{"id": "wafr_security_pillar", "source": "https://docs.aws.amazon.com/wellarchitected/latest/security-pillar/welcome.html", "content": "Security Pillar - AWS Well-Architected Framework\nPublication date: November 6, 2024 ( Document revisions )\nThe focus of this paper is the security pillar of the AWS Well-Architected Framework . It provides guidance to help you apply best practices, current recommendations in the design, delivery, and maintenance of secure AWS workloads.\nIntroduction\nThe AWS Well-Architected Framework helps you understand trade-offs for decisions you make while building workloads on AWS. By using the Framework, you will learn current architectural best practices for designing and operating reliable, secure, efficient, cost-effective, and sustainable workloads in the cloud. It provides a way for you to consistently measure your workload against best practices and identify areas for improvement. We believe that having well-architected workloads greatly increases the likelihood of business success.\nThe framework is based on six pillars:\nOperational Excellence\nOperational Excellence\nSecurity\nSecurity\nReliability\nReliability\nPerformance Efficiency\nPerformance Efficiency\nCost Optimization\nCost Optimization\nSustainability\nSustainability\nThis paper focuses on the security pillar. This will help you meet your business and regulatory requirements by following current AWS recommendations. It’s intended for those in technology roles, such as chief technology officers (CTOs), chief information security officers (CSOs/CISOs), architects, developers, and operations team members.\nAfter reading this paper, you will understand AWS current recommendations and strategies to use when designing cloud architectures with security in mind. This paper doesn’t provide implementation details or architectural patterns but does include references to appropriate resources for this information. By adopting the practices in this paper, you can build architectures that protect your data and systems, control access, and respond automatically to security events.\nJavascript is disabled or is unavailable in your browser.\nTo use the Amazon Web Services Documentation, Javascript must be enabled. Please refer to your browser's Help pages for instructions.\nThanks for letting us know we're doing a good job!\nIf you've got a moment, please tell us what we did right so we can do more of it.\nThanks for letting us know this page needs work. We're sorry we let you down.\nIf you've got a moment, please tell us how we can make the documentation better."}
