{"id": "wafr_operational_excellence", "source": "https://docs.aws.amazon.com/wellarchitected/latest/operational-excellence-pillar/welcome.html", "content": "Operational Excellence Pillar - AWS Well-Architected Framework\nPublication date: November 6, 2024 ( Document revisions )\nThe focus of this paper is the operational excellence pillar of the AWS Well-Architected Framework. It provides guidance to help you apply best practices in the design, delivery, and maintenance of AWS workloads.\nIntroduction\nThe AWS Well-Architected Framework helps you understand the benefits and risks of decisions you make while building workloads on AWS. By using the Framework you will learn operational and architectural best practices for designing and operating reliable, secure, efficient, cost-effective, and sustainable workloads in the cloud. It provides a way to consistently measure your operations and architectures against best practices and identify areas for improvement. We believe that having Well-Architected workloads that are designed with operations in mind greatly increases the likelihood of business success.\nThe framework is based on six pillars:\nOperational Excellence\nOperational Excellence\nSecurity\nSecurity\nReliability\nReliability\nPerformance Efficiency\nPerformance Efficiency\nCost Optimization\nCost Optimization\nSustainability\nSustainability\nThis paper focuses on the operational excellence pillar and how to apply it as the foundation of your well-architected solutions. Operational excellence is challenging to achieve in environments where operations is perceived as a function isolated and distinct from the lines of business and development teams that it supports. By adopting the practices in this paper you can build architectures that provide insight to their status, are activated for effective and efficient operation and event response, and can continue to improve and support your business goals.\nThis paper is intended for those in technology roles, such as chief technology officers (CTOs), architects, developers, and operations team members. After reading this paper, you will understand AWS best practices and the strategies to use when designing cloud architectures for operational excellence. This paper does not provide implementation details or architectural patterns. However, it does include references to appropriate resources for this information.\nJavascript is disabled or is unavailable in your browser.\nTo use the Amazon Web Services Documentation, Javascript must be enabled. Please refer to your browser's Help pages for instructions.\nThanks for letting us know we're doing a good job!\nIf you've got a moment, please tell us what we did right so we can do more of it.\nThanks for letting us know this page needs work. We're sorry we let you down.\nIf you've got a moment, please tell us how we can make the documentation better."}
