{"id": "wafr_cost_optimization_pillar", "source": "https://docs.aws.amazon.com/wellarchitected/latest/cost-optimization-pillar/welcome.html", "content": "Cost Optimization Pillar - AWS Well-Architected Framework\nPublication date: June 27, 2024 ( Document revisions )\nAbstract\nThis whitepaper focuses on the cost optimization pillar of the Amazon Web Services (AWS) Well-Architected Framework. It provides guidance to help customers apply best practices in the design, delivery, and maintenance of AWS environments.\nA cost-optimized workload fully utilizes all resources, achieves an outcome at the lowest possible price point, and meets your functional requirements. This whitepaper provides in-depth guidance for building capability within your organization, designing your workload, selecting your services, configuring and operating the services, and applying cost optimization techniques.\nIntroduction\nThe AWS Well-Architected Framework helps you understand the decisions you make while building workloads on AWS. The Framework provides architectural best practices for designing and operating reliable, secure, efficient, cost-effective, and sustainable workloads in the cloud. It demonstrates a way to consistently measure your architectures against best practices and identify areas for improvement. We believe that having well-architected workloads greatly increases the likelihood of business success.\nThe framework is based on six pillars:\nOperational Excellence\nOperational Excellence\nSecurity\nSecurity\nReliability\nReliability\nPerformance Efficiency\nPerformance Efficiency\nCost Optimization\nCost Optimization\nSustainability\nSustainability\nThis paper focuses on the cost optimization pillar, and how to architect workloads with the most effective use of services and resources, to achieve business outcomes at the lowest price point.\nYou’ll learn how to apply the best practices of the cost optimization pillar within your organization. Cost optimization can be challenging in traditional on-premises solutions because you must predict future capacity and business needs while navigating complex procurement processes. Adopting the practices in this paper will help your organization achieve the following goals:\nPractice Cloud Financial Management\nPractice Cloud Financial Management\nExpenditure and usage awareness\nExpenditure and usage awareness\nCost effective resources\nCost effective resources\nManage demand and supply resources\nManage demand and supply resources\nOptimize over time\nOptimize over time\nThis paper is intended for those in technology and finance roles, such as chief technology officers (CTOs), chief financial officers (CFOs), architects, developers, financial controllers, financial planners, business analysts, and operations team members. This paper does not provide implementation details or architectural patterns, however, it does include references to appropriate resources.\nJavascript is disabled or is unavailable in your browser.\nTo use the Amazon Web Services Documentation, Javascript must be enabled. Please refer to your browser's Help pages for instructions.\nThanks for letting us know we're doing a good job!\nIf you've got a moment, please tell us what we did right so we can do more of it.\nThanks for letting us know this page needs work. We're sorry we let you down.\nIf you've got a moment, please tell us how we can make the documentation better."}
