{"id": "wafr_performance_efficiency_pillar", "source": "https://docs.aws.amazon.com/wellarchitected/latest/performance-efficiency-pillar/welcome.html", "content": "Performance Efficiency Pillar - AWS Well-Architected Framework\nPublication date: November 6, 2024 ( Document revisions )\nThis whitepaper focuses on the performance efficiency pillar of the AWS Well-Architected Framework. It provides guidance to help customers apply best practices in the design, delivery, and maintenance of AWS environments.\nIntroduction\nThe AWS Well-Architected Framework helps you understand the pros and cons of decisions you make while building workloads on AWS. Using the Framework helps you learn architectural best practices for designing and operating reliable, secure, efficient, cost-effective, and sustainable workloads in the cloud. The Framework provides a way for you to consistently measure your architectures against best practices and identify areas for improvement. We believe that having well-architected workloads greatly increases the likelihood of business success.\nThe framework is based on six pillars:\nOperational Excellence\nOperational Excellence\nSecurity\nSecurity\nReliability\nReliability\nPerformance Efficiency\nPerformance Efficiency\nCost Optimization\nCost Optimization\nSustainability\nSustainability\nThis paper focuses on applying the principles of the performance efficiency pillar to your workloads. In traditional, on-premises environments, achieving high and lasting performance is challenging. Using the principles in this paper will help you build architectures on AWS that efficiently deliver sustained performance over time. The guidance and best practices in this document are spread across five key focus areas that serve as guiding principles for building performance efficient cloud solutions on AWS. These focus areas are:\nArchitecture selection\nArchitecture selection\nCompute and hardware\nCompute and hardware\nData management\nData management\nNetworking and content delivery\nNetworking and content delivery\nProcess and culture\nProcess and culture\nThis paper is intended for those in technology roles, such as chief technology officers (CTOs), architects, developers, and operations team members. After reading this paper, you’ll understand AWS best practices and strategies to use when designing a performant cloud architecture.\nJavascript is disabled or is unavailable in your browser.\nTo use the Amazon Web Services Documentation, Javascript must be enabled. Please refer to your browser's Help pages for instructions.\nThanks for letting us know we're doing a good job!\nIf you've got a moment, please tell us what we did right so we can do more of it.\nThanks for letting us know this page needs work. We're sorry we let you down.\nIf you've got a moment, please tell us how we can make the documentation better."}
